# Дана непустая строка S. Вывести строку, содержащую символы строки S,
# между которыми вставлено по одному пробелу.

s = str(input("Введите строку: "))
print(' '.join(s))
